package ch9.item59;

/*
 * item59. 라이브러리를 익히고 사용하라
 *
 * 표준 라이브러리를 사용하는 이점
 * 1. 코드를 작성한 전문가 지식과 다른 프로그래머들의 경험을 활용할 수 있음
 * 2. 핵심적인 일과 크게 관련 없는 문제는 싱경쓰지 않고
 *    기능 개발에 집중할 수 있음
 * 3. 따로 노력하지 않아도 성능이 지속적으로 개선됨
 *  여러 사용자들이 성능을 계속 확인하기 때문에
 *  표준 라이브러리 제작자들은 더 나은 방법을 모색해야 함
 * 4. 기능이 계속 추가됨
 *  부족한 부분이 개발자 커뮤니티에서 논의되고 추가되곤 함
 * 5. 작성한 코드가 많은 사람에게 낯익어짐
 *  자연스럽게 다른 개발자들이 읽기 좋고, 유지보수하기 좋고, 재활용하기 좋아짐
 * 
 *  많은 프로그래머가 직접 구현하는 이유
 * : 라이브러리에 해당 기능이 있는지 모르기 때문
 * 
 *  자바 프로그래머라면 적어도 java.lang, java.util, java.io와
 * 하위 패키지들은 익숙해져야 함
 *
 *  라이브러리가 필요한 기능을 충분히 제공하지 못할 수 있음
 * 어떤 라이브러리든 필요한 기능을 모두 제공할 수는 없으므로
 * 자바 표준 라이브러리에서 찾지 못하면
 * 구글의 구아바 라이브러리같은 고품질 서드파티 라이브러리를 찾아보고,
 * 그마저도 찾지 못했다면 직접 구현
 */
public class item59 {
}
